In [2]:
import pandas as pd

In [4]:
student_list = {
    "name": ["John", "Nate", "Edward", "Zara", "John"],
    "major": [
        "Computer Science", "Computer Science", "Computer Science",
        "Psychology", "Computer Science"
    ],
    "gender": ["male", "male", "male", "female", "male"]
}
df = pd.DataFrame(student_list)
df

     name             major  gender
0    John  Computer Science    male
1    Nate  Computer Science    male
2  Edward  Computer Science    male
3    Zara        Psychology  female
4    John  Computer Science    male

In [5]:
# John 이라는 중복 데이터가 들어간 것을 제거하고 싶다면?


# 중복 데이터가 있는지 확인하기 => 5번째 행 데이터가 True 로 나옴
df.duplicated()

0    False
1    False
2    False
3    False
4     True
dtype: bool

In [8]:
# 원본 데이터가 변경된 것은 아님

df.drop_duplicates()

     name             major  gender
0    John  Computer Science    male
1    Nate  Computer Science    male
2  Edward  Computer Science    male
3    Zara        Psychology  female

In [9]:
# 이름이 동일한 중복 데이터가 있다면 삭제하기

# ① 데이터 프레임 생성
student_list = {
    "name": ["John", "Nate", "Edward", "Zara", "Wendy", "Nate", "John"],
    "major": [
        "Computer Science", "Computer Science", "Computer Science",
        "Psychology", "Economics", "None", "Economics"
    ],
    "gender": ["male", "male", "male", "female", "female", "male", "male"]
}
df = pd.DataFrame(student_list)
df

     name             major  gender
0    John  Computer Science    male
1    Nate  Computer Science    male
2  Edward  Computer Science    male
3    Zara        Psychology  female
4   Wendy         Economics  female
5    Nate              None    male
6    John         Economics    male

In [11]:
# 중복 데이터를 삭제하고 싶다?

df.duplicated()   # 중복 데이터 안 나옴 : 행이 정확히 일치하지 않기 때문에

0    False
1    False
2    False
3    False
4    False
5    False
6    False
dtype: bool

In [13]:
# 이름이 동일한 중복 데이터가 있다면 삭제하기

# ② 이름 열에서 중복 데이터를 찾기
# df['name'].duplicated()
df.duplicated('name')

0    False
1    False
2    False
3    False
4    False
5     True
6     True
dtype: bool

In [14]:
# df['name'].drop_duplicates()

df.drop_duplicates('name', keep="first")  # keep : 중복 데이터 중에서 어느 부분을 살릴 것인가? default는 first

     name             major  gender
0    John  Computer Science    male
1    Nate  Computer Science    male
2  Edward  Computer Science    male
3    Zara        Psychology  female
4   Wendy         Economics  female